- Database Name : RSQL
- Table Name : score
- id(pk),korean,englisg,mathmatics

In [1]:
library(RMySQL)

Loading required package: DBI

In [2]:
# DB Connection
conn <- dbConnect(MySQL(),
                    dbname = 'RSQL',       # schema
                    user = 'root',
                    password = 'qwer1234',
                    host = '127.0.0.1',    #ip adress
)

In [3]:
# 테이블 목록 
dbListTables(conn)

[1] "score"

In [4]:
# 테이블의 컬럼 목록 
dbListFields(conn,'score')

[1] "id"          "korean"      "english"     "mathematics"

In [5]:
# Select
dbGetQuery(conn,'select count(*) from score')

  count(*)
1 10

In [6]:
dbGetQuery(conn,' select * from score')

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100

In [7]:
# insert
dbSendQuery(conn,'insert into score values (1,100,100,100)')
result = dbGetQuery(conn,'select * from score')
result

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100
11  1 100    100     100

In [8]:
# insert - 2 
dbSendQuery(conn,'insert into score values (2,90,90,90)')
result = dbGetQuery(conn,'select * from score')
result

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100
11  1 100    100     100
12  2  90     90      90

In [9]:
# Update 
dbSendQuery(conn,'update score set korean= 90, english=80 , mathematics=70 where id =2')
result = dbGetQuery(conn,'select * from score')
result

   id korean english mathematics
1   1  90     80      70
2   2  90     80      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100
11  1 100    100     100
12  2  90     80      70

In [10]:
# delete
dbSendQuery(conn,'delete from score')
result = dbGetQuery(conn,'select * from score')
result

     id korean english mathematics

In [11]:
# csv file 읽어서 MySQL에 넣기 
data <- read.csv("../Data/score.csv", header= F)
colnames(data) <- c('id','korean','english','mathematics')
data

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100

In [12]:
dbWriteTable(conn, "score",data,overwrite= T, row.names =F) #table name, data name, overwrite (새로 부를때), row.names 없을때 
# append = T

[1] TRUE

In [13]:
result = dbGetQuery(conn,'select * from score')
result

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100

In [21]:
# csv file 읽어서 MySQL에 넣기 
data2 <- read.csv("../Data/score2.csv", header= F)
colnames(data2) <- c('id','korean','english','mathematics')
data2

  id korean english mathematics
1 11 90     80      70
2 12 90     88      70

In [22]:
dbWriteTable(conn, "score",data2,overwrite= F, row.names =F,append =T) # 연결

[1] TRUE

In [23]:
result = dbGetQuery(conn,'select * from score')
result

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100
11 11  90     80      70
12 12  90     88      70

In [24]:
# disconnect
dbDisconnect(conn)

[1] TRUE